electron-rare/le-mystere-professeur-zacus/hardware/firmware/hardware/esp_oscillo/src/main_esp8266_oled 3.cpp
#include <Arduino.h>

#if defined(ARDUINO_ARCH_ESP8266)

#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <EEPROM.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <Wire.h>
#include <espnow.h>

extern "C" {
#include <user_interface.h>
}

namespace {

constexpr char kDeviceName[] = "OSCILLO-8266";

constexpr char kDefaultSsid[] = "Les cils";
constexpr char kDefaultPass[] = "mascarade";

constexpr char kFallbackApSsid[] = "OSCILLO_AP";
constexpr char kFallbackApPass[] = "oscillo42";
constexpr char kMorseText[] = "LEFOU";

// ESP8266 has one ADC channel only.
constexpr uint8_t kJoyAdcPin = A0;
constexpr uint8_t kJoySwPin = D3;
// Reserve D4 for Morse output, disable dedicated status LED pin.
constexpr uint8_t kStatusLedPin = 0xFF;
constexpr bool kStatusLedActiveLow = true;
// Morse output pin (bootstrap pin: keep external load high-impedance on boot).
constexpr uint8_t kMorseOutPin = D4;
// 4-bit pseudo DAC outputs (R-2R/resistor summer + RC filter recommended).
constexpr uint8_t kPcm4BitPins[4] = {D5, D6, D7, D8};

#if defined(OLED_ALT_D5_D6)
constexpr uint8_t kOledSdaPin = D5;
constexpr uint8_t kOledSclPin = D6;
constexpr char kOledBusLabel[] = "D5/D6";
#elif defined(OLED_SDA_PIN) && defined(OLED_SCL_PIN)
constexpr uint8_t kOledSdaPin = OLED_SDA_PIN;
constexpr uint8_t kOledSclPin = OLED_SCL_PIN;
constexpr char kOledBusLabel[] = "DA(D1)/D2";
#else
constexpr uint8_t kOledSdaPin = D1;
constexpr uint8_t kOledSclPin = D2;
constexpr char kOledBusLabel[] = "DA(D1)/D2";
#endif

constexpr uint8_t kOledWidth = 128;
constexpr uint8_t kOledHeight = 64;

constexpr uint32_t kStaConnectTimeoutMs = 12000;
constexpr uint32_t kWifiRetryMs = 15000;
constexpr uint32_t kWifiScanCacheMs = 15000;
constexpr size_t kMaxScanEntries = 24;

constexpr uint32_t kJoystickPollMs = 200;
constexpr uint32_t kOledRefreshMs = 200;
constexpr uint32_t kLedBlinkFastMs = 180;
constexpr uint32_t kLedBlinkSlowMs = 500;
constexpr uint32_t kLedHeartbeatPeriodMs = 1200;
constexpr uint32_t kLedHeartbeatOnMs = 70;
constexpr uint32_t kLogPeriodMs = 1500;
constexpr uint16_t kMorseUnitMs = 350;
constexpr uint32_t kSineSamplePeriodUs = 300;
constexpr uint32_t kScopeSampleMs = 40;
constexpr uint8_t kSineAmpMin = 5;
constexpr uint8_t kSineAmpMax = 18;
constexpr uint32_t kSineAmpMinStepMs = 120;
constexpr uint32_t kSineAmpMaxStepMs = 420;
constexpr uint32_t kEspNowDiscoveryPeriodMs = 60000;
constexpr uint32_t kEspNowPeerActiveMs = 180000;
constexpr size_t kEspNowMaxPeers = 16;
constexpr size_t kEspNowRxTextMax = 180;
constexpr size_t kEspNowNameMax = 20;

struct MorseStep {
  char letter;
  bool on;
  uint8_t units;
};

constexpr MorseStep kMorseSequence[] = {
    // L .-..
    {'L', true, 1},  {'L', false, 1}, {'L', true, 3},  {'L', false, 1},
    {'L', true, 1},  {'L', false, 1}, {'L', true, 1},  {'L', false, 8},
    // E .
    {'E', true, 1},  {'E', false, 8},
    // F ..-.
    {'F', true, 1},  {'F', false, 1}, {'F', true, 1},  {'F', false, 1},
    {'F', true, 3},  {'F', false, 1}, {'F', true, 1},  {'F', false, 8},
    // O ---
    {'O', true, 3},  {'O', false, 1}, {'O', true, 3},  {'O', false, 1},
    {'O', true, 3},  {'O', false, 8},
    // U ..-
    {'U', true, 1},  {'U', false, 1}, {'U', true, 1},  {'U', false, 1},
    {'U', true, 3},  {'U', false, 12},
};
constexpr size_t kMorseSequenceLen = sizeof(kMorseSequence) / sizeof(kMorseSequence[0]);
constexpr uint8_t kSine4BitLut[] = {
    8,  9,  11, 12, 13, 14, 15, 15,
    15, 14, 13, 12, 11, 9,  8,  6,
    5,  3,  2,  1,  0,  0,  0,  1,
    2,  3,  5,  6,  8,  9,  11, 12,
};
constexpr size_t kSine4BitLen = sizeof(kSine4BitLut) / sizeof(kSine4BitLut[0]);

constexpr uint16_t kEepromSize = 256;
constexpr uint32_t kCfgMagic = 0x4F534338;  // 'OSC8'

struct WifiConfigBlob {
  uint32_t magic;
  char ssid[33];
  char pass[65];
  uint32_t checksum;
};

struct WifiScanEntry {
  String ssid;
  int32_t rssi;
  uint8_t channel;
  uint8_t bssid[6];
};

struct EspNowPeerEntry {
  uint8_t mac[6];
  uint32_t firstSeenMs;
  uint32_t lastSeenMs;
  uint32_t rxCount;
  char name[kEspNowNameMax + 1];
  char lastType[16];
};

ESP8266WebServer gServer(80);
Adafruit_SSD1306 gDisplay(kOledWidth, kOledHeight, &Wire, -1);

WifiConfigBlob gCfg{};
String gStaSsid;
String gStaPass;

WifiScanEntry gScanEntries[kMaxScanEntries];
size_t gScanCount = 0;
uint32_t gLastScanMs = 0;

bool gStaConnecting = false;
bool gApActive = false;
uint32_t gStaConnectStartMs = 0;
uint32_t gLastWifiAttemptMs = 0;

uint16_t gJoyRaw = 0;
float gJoySmooth = 512.0f;
bool gJoySwPressed = false;

bool gOledReady = false;
uint8_t gOledAddr = 0;

char gMorseLetter = 'L';
bool gMorseOn = false;
size_t gMorseStepIndex = 0;
uint32_t gMorseStepStartMs = 0;
uint32_t gMorseStepDurationMs = 0;

uint32_t gLastJoystickMs = 0;
uint32_t gLastOledMs = 0;
uint32_t gLastLogMs = 0;
uint32_t gLastSineUs = 0;
size_t gSineIndex = 0;
uint32_t gLastScopeSampleMs = 0;
uint32_t gLastSineAmpUpdateMs = 0;
uint32_t gNextSineAmpDelayMs = kSineAmpMinStepMs;
uint8_t gSineGlitchAmp = 10;
uint8_t gMorseScope[kOledWidth] = {0};
size_t gMorseScopeHead = 0;

bool gEspNowReady = false;
uint32_t gEspNowTxOk = 0;
uint32_t gEspNowTxFail = 0;
uint32_t gEspNowRxCount = 0;
uint32_t gEspNowLastTxMs = 0;
uint32_t gEspNowLastRxMs = 0;
char gEspNowLastPeer[18] = "-";
bool gEspNowForceDiscovery = false;
EspNowPeerEntry gEspNowPeers[kEspNowMaxPeers];
size_t gEspNowPeerCount = 0;

String gSerialLine;

const uint8_t kEspNowBroadcastMac[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

uint32_t fnv1a32(const uint8_t* data, size_t len) {
  uint32_t hash = 2166136261u;
  for (size_t i = 0; i < len; ++i) {
    hash ^= data[i];
    hash *= 16777619u;
  }
  return hash;
}

uint32_t configChecksum(const WifiConfigBlob& cfg) {
  return fnv1a32(reinterpret_cast<const uint8_t*>(&cfg),
                 sizeof(WifiConfigBlob) - sizeof(cfg.checksum));
}

void safeStringCopy(char* dst, size_t dstSize, const String& src) {
  if (dstSize == 0) {
    return;
  }
  size_t n = src.length();
  if (n >= dstSize) {
    n = dstSize - 1;
  }
  memcpy(dst, src.c_str(), n);
  dst[n] = '\0';
}

String jsonEscape(const String& in) {
  String out;
  out.reserve(in.length() + 8);
  for (size_t i = 0; i < in.length(); ++i) {
    const char c = in.charAt(i);
    switch (c) {
      case '"':
        out += "\\\"";
        break;
      case '\\':
        out += "\\\\";
        break;
      case '\n':
        out += "\\n";
        break;
      case '\r':
        out += "\\r";
        break;
      case '\t':
        out += "\\t";
        break;
      default:
        out += c;
        break;
    }
  }
  return out;
}

String ipToString(const IPAddress& ip) {
  return String(ip[0]) + "." + String(ip[1]) + "." + String(ip[2]) + "." + String(ip[3]);
}

