electron-rare/le-mystere-professeur-zacus/hardware/firmware/hardware/esp_oscillo/src/main_esp8266_oled 3.cpp
void formatMac(const uint8_t* mac, char* out, size_t outSize) {
  if (outSize < 18) {
    if (outSize > 0) {
      out[0] = '\0';
    }
    return;
  }
  snprintf(out, outSize, "%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3],
           mac[4], mac[5]);
}

bool jsonExtractString(const char* text, const char* key, char* out, size_t outSize) {
  if (outSize == 0 || text == nullptr || key == nullptr) {
    return false;
  }
  out[0] = '\0';

  char pattern[32];
  snprintf(pattern, sizeof(pattern), "\"%s\":\"", key);
  const char* p = strstr(text, pattern);
  if (p == nullptr) {
    return false;
  }
  p += strlen(pattern);

  size_t i = 0;
  while (*p != '\0' && *p != '"' && (i + 1) < outSize) {
    out[i++] = *p++;
  }
  out[i] = '\0';
  return i > 0;
}

void sanitizeAsciiText(char* text) {
  if (text == nullptr) {
    return;
  }
  for (size_t i = 0; text[i] != '\0'; ++i) {
    const char c = text[i];
    if (c < 32 || c > 126) {
      text[i] = '_';
    }
  }
}

int findEspNowPeerIndex(const uint8_t* mac) {
  for (size_t i = 0; i < gEspNowPeerCount; ++i) {
    if (memcmp(gEspNowPeers[i].mac, mac, 6) == 0) {
      return static_cast<int>(i);
    }
  }
  return -1;
}

int allocEspNowPeerIndex(const uint8_t* mac, uint32_t nowMs) {
  if (gEspNowPeerCount < kEspNowMaxPeers) {
    const size_t idx = gEspNowPeerCount++;
    memset(&gEspNowPeers[idx], 0, sizeof(gEspNowPeers[idx]));
    memcpy(gEspNowPeers[idx].mac, mac, 6);
    gEspNowPeers[idx].firstSeenMs = nowMs;
    gEspNowPeers[idx].lastSeenMs = nowMs;
    gEspNowPeers[idx].rxCount = 0;
    strncpy(gEspNowPeers[idx].name, "?", sizeof(gEspNowPeers[idx].name) - 1);
    strncpy(gEspNowPeers[idx].lastType, "?", sizeof(gEspNowPeers[idx].lastType) - 1);
    return static_cast<int>(idx);
  }

  size_t oldestIdx = 0;
  uint32_t oldestSeen = gEspNowPeers[0].lastSeenMs;
  for (size_t i = 1; i < gEspNowPeerCount; ++i) {
    if (gEspNowPeers[i].lastSeenMs < oldestSeen) {
      oldestSeen = gEspNowPeers[i].lastSeenMs;
      oldestIdx = i;
    }
  }
  memset(&gEspNowPeers[oldestIdx], 0, sizeof(gEspNowPeers[oldestIdx]));
  memcpy(gEspNowPeers[oldestIdx].mac, mac, 6);
  gEspNowPeers[oldestIdx].firstSeenMs = nowMs;
  gEspNowPeers[oldestIdx].lastSeenMs = nowMs;
  strncpy(gEspNowPeers[oldestIdx].name, "?", sizeof(gEspNowPeers[oldestIdx].name) - 1);
  strncpy(gEspNowPeers[oldestIdx].lastType, "?", sizeof(gEspNowPeers[oldestIdx].lastType) - 1);
  return static_cast<int>(oldestIdx);
}

void updateEspNowPeer(const uint8_t* mac, const char* type, const char* name) {
  const uint32_t nowMs = millis();
  int idx = findEspNowPeerIndex(mac);
  if (idx < 0) {
    idx = allocEspNowPeerIndex(mac, nowMs);
  }
  if (idx < 0) {
    return;
  }

  EspNowPeerEntry& peer = gEspNowPeers[static_cast<size_t>(idx)];
  peer.lastSeenMs = nowMs;
  ++peer.rxCount;
  if (type != nullptr && type[0] != '\0') {
    strncpy(peer.lastType, type, sizeof(peer.lastType) - 1);
    peer.lastType[sizeof(peer.lastType) - 1] = '\0';
  }
  if (name != nullptr && name[0] != '\0') {
    strncpy(peer.name, name, sizeof(peer.name) - 1);
    peer.name[sizeof(peer.name) - 1] = '\0';
  }
}

size_t countEspNowActivePeers(uint32_t nowMs) {
  size_t count = 0;
  for (size_t i = 0; i < gEspNowPeerCount; ++i) {
    if ((nowMs - gEspNowPeers[i].lastSeenMs) <= kEspNowPeerActiveMs) {
      ++count;
    }
  }
  return count;
}

bool sendEspNowFrame(const uint8_t* mac, const char* type) {
  if (!gEspNowReady || mac == nullptr || type == nullptr) {
    return false;
  }

  char payload[200];
  const int n = snprintf(payload, sizeof(payload),
                         "{\"type\":\"%s\",\"device\":\"%s\",\"uptime_ms\":%lu}", type,
                         kDeviceName, static_cast<unsigned long>(millis()));
  if (n <= 0) {
    return false;
  }

  const uint8_t rc =
      esp_now_send(const_cast<uint8_t*>(mac), reinterpret_cast<uint8_t*>(payload),
                   static_cast<uint8_t>(strnlen(payload, sizeof(payload))));
  if (rc != 0) {
    ++gEspNowTxFail;
    return false;
  }
  return true;
}

void onEspNowSent(uint8_t* macAddr, uint8_t status) {
  (void)macAddr;
  if (status == 0) {
    ++gEspNowTxOk;
  } else {
    ++gEspNowTxFail;
  }
}

void onEspNowRecv(uint8_t* macAddr, uint8_t* data, uint8_t len) {
  if (macAddr == nullptr || data == nullptr || len == 0) {
    return;
  }

  ++gEspNowRxCount;
  gEspNowLastRxMs = millis();
  formatMac(macAddr, gEspNowLastPeer, sizeof(gEspNowLastPeer));

  const size_t n = (len < kEspNowRxTextMax) ? len : kEspNowRxTextMax;
  char text[kEspNowRxTextMax + 1];
  memcpy(text, data, n);
  text[n] = '\0';
  sanitizeAsciiText(text);

  char type[16] = {0};
  char name[kEspNowNameMax + 1] = {0};
  if (!jsonExtractString(text, "type", type, sizeof(type))) {
    return;
  }
  if (!jsonExtractString(text, "device", name, sizeof(name))) {
    jsonExtractString(text, "name", name, sizeof(name));
  }

  updateEspNowPeer(macAddr, type, name);
  if (strcmp(type, "discovery") == 0) {
    esp_now_add_peer(macAddr, ESP_NOW_ROLE_COMBO, 0, nullptr, 0);
    sendEspNowFrame(macAddr, "announce");
  }
}

void initEspNow() {
  if (esp_now_init() != 0) {
    gEspNowReady = false;
    Serial.println("[ESPNOW] init failed");
    return;
  }

  esp_now_set_self_role(ESP_NOW_ROLE_COMBO);
  esp_now_register_send_cb(onEspNowSent);
  esp_now_register_recv_cb(onEspNowRecv);
  esp_now_add_peer(const_cast<uint8_t*>(kEspNowBroadcastMac), ESP_NOW_ROLE_COMBO, 0, nullptr, 0);

  gEspNowReady = true;
  Serial.println("[ESPNOW] ready (broadcast+discovery)");
}

void serviceEspNow(uint32_t nowMs) {
  if (!gEspNowReady) {
    return;
  }
  if (!gEspNowForceDiscovery && (nowMs - gEspNowLastTxMs) < kEspNowDiscoveryPeriodMs) {
    return;
  }
  gEspNowForceDiscovery = false;
  gEspNowLastTxMs = nowMs;
  sendEspNowFrame(kEspNowBroadcastMac, "discovery");
}

void setStatusLed(bool on) {
  if (kStatusLedPin == 0xFF) {
    return;
  }
  const bool active = kStatusLedActiveLow ? !on : on;
  digitalWrite(kStatusLedPin, active ? HIGH : LOW);
}

void setWifiConfigDefaults() {
  memset(&gCfg, 0, sizeof(gCfg));
  gCfg.magic = kCfgMagic;
  safeStringCopy(gCfg.ssid, sizeof(gCfg.ssid), String(kDefaultSsid));
  safeStringCopy(gCfg.pass, sizeof(gCfg.pass), String(kDefaultPass));
  gCfg.checksum = configChecksum(gCfg);
}

