electron-rare/le-mystere-professeur-zacus/hardware/firmware/hardware/esp_oscillo/src/main_esp8266_oled 3.cpp
void saveWifiCredentialsToEeprom(const String& ssid, const String& pass) {
  gCfg.magic = kCfgMagic;
  safeStringCopy(gCfg.ssid, sizeof(gCfg.ssid), ssid);
  safeStringCopy(gCfg.pass, sizeof(gCfg.pass), pass);
  gCfg.checksum = configChecksum(gCfg);
  EEPROM.put(0, gCfg);
  EEPROM.commit();
  gStaSsid = String(gCfg.ssid);
  gStaPass = String(gCfg.pass);
}

void loadWifiCredentialsFromEeprom() {
  EEPROM.get(0, gCfg);
  const bool magicOk = (gCfg.magic == kCfgMagic);
  const bool csumOk = (gCfg.checksum == configChecksum(gCfg));
  const bool ssidOk = (gCfg.ssid[0] != '\0');

  if (!magicOk || !csumOk || !ssidOk) {
    setWifiConfigDefaults();
    EEPROM.put(0, gCfg);
    EEPROM.commit();
  }

  gStaSsid = String(gCfg.ssid);
  gStaPass = String(gCfg.pass);
}

void refreshWifiScanCache(bool force) {
  const uint32_t nowMs = millis();
  if (!force && (nowMs - gLastScanMs) < kWifiScanCacheMs) {
    return;
  }

  gScanCount = 0;
  const int found = WiFi.scanNetworks();
  if (found <= 0) {
    gLastScanMs = nowMs;
    return;
  }

  const size_t limit = (found < static_cast<int>(kMaxScanEntries)) ? static_cast<size_t>(found)
                                                                    : kMaxScanEntries;
  for (size_t i = 0; i < limit; ++i) {
    WifiScanEntry& entry = gScanEntries[i];
    entry.ssid = WiFi.SSID(i);
    entry.rssi = WiFi.RSSI(i);
    entry.channel = static_cast<uint8_t>(WiFi.channel(i));
    const uint8_t* bssid = WiFi.BSSID(i);
    if (bssid != nullptr) {
      memcpy(entry.bssid, bssid, sizeof(entry.bssid));
    } else {
      memset(entry.bssid, 0, sizeof(entry.bssid));
    }
    ++gScanCount;
  }

  gLastScanMs = nowMs;
}

int findBestNetworkIndexForSsid(const String& ssid) {
  int bestIndex = -1;
  int32_t bestRssi = -127;
  for (size_t i = 0; i < gScanCount; ++i) {
    if (gScanEntries[i].ssid == ssid && gScanEntries[i].rssi > bestRssi) {
      bestRssi = gScanEntries[i].rssi;
      bestIndex = static_cast<int>(i);
    }
  }
  return bestIndex;
}

void ensureFallbackAp() {
  if (gApActive) {
    return;
  }

  WiFi.mode(WIFI_AP_STA);
  const bool ok = WiFi.softAP(kFallbackApSsid, kFallbackApPass);
  gApActive = ok;
  if (ok) {
    Serial.printf("[WIFI] AP fallback active ssid=%s ip=%s\n", kFallbackApSsid,
                  ipToString(WiFi.softAPIP()).c_str());
  } else {
    Serial.println("[WIFI] Failed to start AP fallback");
  }
}

void stopFallbackAp() {
  if (!gApActive) {
    return;
  }
  WiFi.softAPdisconnect(true);
  gApActive = false;
  if (WiFi.status() == WL_CONNECTED) {
    WiFi.mode(WIFI_STA);
  }
}

bool beginStaConnectWithBestRssi() {
  if (gStaSsid.isEmpty()) {
    return false;
  }

  WiFi.persistent(false);
  WiFi.mode(WIFI_STA);
  gApActive = false;
  refreshWifiScanCache(true);

  const int bestIdx = findBestNetworkIndexForSsid(gStaSsid);
  if (bestIdx >= 0) {
    const WifiScanEntry& e = gScanEntries[static_cast<size_t>(bestIdx)];
    WiFi.begin(gStaSsid.c_str(), gStaPass.c_str(), e.channel, e.bssid, true);
    char macText[18] = "-";
    formatMac(e.bssid, macText, sizeof(macText));
    Serial.printf("[WIFI] STA connect to '%s' rssi=%ld ch=%u bssid=%s\n", e.ssid.c_str(),
                  static_cast<long>(e.rssi), e.channel, macText);
  } else {
    WiFi.begin(gStaSsid.c_str(), gStaPass.c_str());
    Serial.printf("[WIFI] STA connect to '%s' (best RSSI candidate not found in scan)\n",
                  gStaSsid.c_str());
  }

  gStaConnecting = true;
  gStaConnectStartMs = millis();
  gLastWifiAttemptMs = gStaConnectStartMs;
  return true;
}

String wifiModeText() {
  if (WiFi.status() == WL_CONNECTED) {
    return "STA";
  }
  if (gStaConnecting) {
    return "STA_CONNECTING";
  }
  if (gApActive) {
    return "AP_FALLBACK";
  }
  return "DISCONNECTED";
}

void serviceWifi(uint32_t nowMs) {
  if (WiFi.status() == WL_CONNECTED) {
    gStaConnecting = false;
    stopFallbackAp();
    return;
  }

  if (gStaConnecting && (nowMs - gStaConnectStartMs) > kStaConnectTimeoutMs) {
    gStaConnecting = false;
    ensureFallbackAp();
  }

  if (!gStaConnecting && (nowMs - gLastWifiAttemptMs) >= kWifiRetryMs) {
    beginStaConnectWithBestRssi();
  }
}

void sampleJoystick(uint32_t nowMs) {
  if ((nowMs - gLastJoystickMs) < kJoystickPollMs) {
    return;
  }
  gLastJoystickMs = nowMs;

  gJoyRaw = analogRead(kJoyAdcPin);
  gJoySmooth = (0.8f * gJoySmooth) + (0.2f * static_cast<float>(gJoyRaw));
  gJoySwPressed = (digitalRead(kJoySwPin) == LOW);
}

void writePcm4Bit(uint8_t nibble) {
  for (size_t i = 0; i < 4; ++i) {
    digitalWrite(kPcm4BitPins[i], ((nibble >> i) & 0x01U) ? HIGH : LOW);
  }
}

void servicePseudoSine(uint32_t nowUs) {
  if ((nowUs - gLastSineUs) < kSineSamplePeriodUs) {
    return;
  }
  gLastSineUs = nowUs;
  writePcm4Bit(kSine4BitLut[gSineIndex]);
  gSineIndex = (gSineIndex + 1U) % kSine4BitLen;
}

void refreshMorseOutput() { digitalWrite(kMorseOutPin, gMorseOn ? HIGH : LOW); }

void pushMorseScopeSample(bool levelHigh) {
  gMorseScope[gMorseScopeHead] = levelHigh ? 1 : 0;
  gMorseScopeHead = (gMorseScopeHead + 1U) % kOledWidth;
}

void serviceMorseScope(uint32_t nowMs) {
  if ((nowMs - gLastScopeSampleMs) < kScopeSampleMs) {
    return;
  }
  gLastScopeSampleMs = nowMs;
  pushMorseScopeSample(gMorseOn);
}

void drawMorseScope(uint32_t nowMs) {
  constexpr int scopeX = 0;
  constexpr int scopeY = 0;
  constexpr int scopeW = 128;
  constexpr int scopeH = 64;
  constexpr int yHigh = scopeY + 8;
  constexpr int yLow = scopeY + scopeH - 8;

  int prevX = scopeX + 1;
  int prevY = yLow;
  for (int x = 0; x < (scopeW - 2); ++x) {
    const size_t idx = (gMorseScopeHead + static_cast<size_t>(x)) % kOledWidth;
    const bool on = (gMorseScope[idx] != 0);
    const int curX = scopeX + 1 + x;
    const int curY = on ? yHigh : yLow;
    if (x > 0) {
      gDisplay.drawLine(prevX, prevY, curX, curY, SSD1306_WHITE);
    }
    prevX = curX;
    prevY = curY;
  }

  // Overlay a synthetic sine with deterministic glitches.
  constexpr int yCenter = scopeY + (scopeH / 2);
  const int amp = static_cast<int>(gSineGlitchAmp);
  int prevSineX = scopeX;
  int prevSineY = yCenter;
  for (int x = 0; x < scopeW; ++x) {
    const size_t lutIdx = (gSineIndex + static_cast<size_t>(x * 2U) +
                           static_cast<size_t>((nowMs >> 4U) & 0x1FU)) %
                          kSine4BitLen;
    const int base = static_cast<int>(kSine4BitLut[lutIdx]) - 8;  // -8..+7
    int y = yCenter - ((base * amp) / 8);

    const uint8_t noise = static_cast<uint8_t>((x * 37U) ^ (nowMs >> 3U) ^ (gSineIndex * 13U));
    if ((noise & 0x1F) == 0x03 || (noise & 0x1F) == 0x11) {
      const int spike = 6 + static_cast<int>(noise & 0x07);
      y += ((noise & 0x80) != 0) ? spike : -spike;
    }
    y = constrain(y, scopeY, scopeY + scopeH - 1);

    if (x > 0) {
      gDisplay.drawLine(prevSineX, prevSineY, scopeX + x, y, SSD1306_WHITE);
    }
    prevSineX = scopeX + x;
    prevSineY = y;
  }
}

void serviceGlitchSineAmplitude(uint32_t nowMs) {
  if ((nowMs - gLastSineAmpUpdateMs) < gNextSineAmpDelayMs) {
    return;
  }
  gLastSineAmpUpdateMs = nowMs;
  gNextSineAmpDelayMs =
      static_cast<uint32_t>(random(static_cast<long>(kSineAmpMinStepMs), static_cast<long>(kSineAmpMaxStepMs + 1U)));
  gSineGlitchAmp = static_cast<uint8_t>(
      random(static_cast<long>(kSineAmpMin), static_cast<long>(kSineAmpMax + 1U)));
}

