electron-rare/le-mystere-professeur-zacus/hardware/firmware/hardware/esp_oscillo/src/main_esp8266_oled 3.cpp
void startMorseStep(uint32_t nowMs) {
  const MorseStep& step = kMorseSequence[gMorseStepIndex];
  gMorseLetter = step.letter;
  gMorseOn = step.on;
  refreshMorseOutput();
  gMorseStepDurationMs = static_cast<uint32_t>(step.units) * kMorseUnitMs;
  gMorseStepStartMs = nowMs;
}

void serviceMorse(uint32_t nowMs) {
  if ((nowMs - gMorseStepStartMs) < gMorseStepDurationMs) {
    return;
  }
  gMorseStepIndex = (gMorseStepIndex + 1U) % kMorseSequenceLen;
  startMorseStep(nowMs);
}

char morsePulseSymbol() {
  if (!gMorseOn) {
    return ' ';
  }
  return kMorseSequence[gMorseStepIndex].units >= 3 ? '-' : '.';
}

void updateStatusLed(uint32_t nowMs) {
  if (WiFi.status() == WL_CONNECTED) {
    const uint32_t t = nowMs % kLedHeartbeatPeriodMs;
    setStatusLed(t < kLedHeartbeatOnMs);
    return;
  }

  if (gStaConnecting) {
    setStatusLed((nowMs / kLedBlinkFastMs) % 2 == 0);
    return;
  }

  if (gApActive) {
    const uint32_t phase = nowMs % 1000;
    const bool on = (phase < 80) || (phase >= 160 && phase < 240);
    setStatusLed(on);
    return;
  }

  setStatusLed((nowMs / kLedBlinkSlowMs) % 2 == 0);
}

bool probeI2cAddress(uint8_t address) {
  Wire.beginTransmission(address);
  return Wire.endTransmission() == 0;
}

void scanI2cBusToSerial() {
  Serial.printf("[I2C] Scan on SDA=%u SCL=%u\n", kOledSdaPin, kOledSclPin);
  uint8_t found = 0;
  for (uint8_t addr = 1; addr < 127; ++addr) {
    if (probeI2cAddress(addr)) {
      Serial.printf("[I2C] Found device at 0x%02X\n", addr);
      ++found;
    }
  }
  if (found == 0) {
    Serial.println("[I2C] No device found");
  }
}

void initOled() {
  Wire.begin(kOledSdaPin, kOledSclPin);
  Wire.setClock(400000);

  const uint8_t addresses[] = {0x3C, 0x3D};
  for (size_t i = 0; i < sizeof(addresses); ++i) {
    const uint8_t address = addresses[i];
    if (!probeI2cAddress(address)) {
      continue;
    }

    if (gDisplay.begin(SSD1306_SWITCHCAPVCC, address)) {
      gOledReady = true;
      gOledAddr = address;
      break;
    }
  }

  if (!gOledReady) {
    Serial.println("[OLED] SSD1306 not found on 0x3C/0x3D");
    return;
  }

  gDisplay.clearDisplay();
  gDisplay.setTextSize(1);
  gDisplay.setTextColor(SSD1306_WHITE);
  gDisplay.setCursor(0, 0);
  gDisplay.println(F("OSCILLO ESP8266"));
  gDisplay.println(F("OLED online"));
  gDisplay.printf("I2C: %s\n", kOledBusLabel);
  gDisplay.printf("ADDR: 0x%02X\n", gOledAddr);
  gDisplay.display();
  Serial.printf("[OLED] Ready addr=0x%02X SDA=%u SCL=%u\n", gOledAddr, kOledSdaPin, kOledSclPin);
}

void drawOled(uint32_t nowMs) {
  if (!gOledReady || (nowMs - gLastOledMs) < kOledRefreshMs) {
    return;
  }
  gLastOledMs = nowMs;

  gDisplay.clearDisplay();
  drawMorseScope(nowMs);
  gDisplay.display();
}

String buildStatusJson() {
  const uint32_t nowMs = millis();
  String out = "{";
  out += "\"device\":\"" + String(kDeviceName) + "\",";
  out += "\"uptime_ms\":" + String(nowMs) + ",";
  out += "\"wifi_mode\":\"" + wifiModeText() + "\",";
  out += "\"ssid\":\"" + jsonEscape(gStaSsid) + "\",";
  out += "\"ip\":\"" + jsonEscape(ipToString(WiFi.localIP())) + "\",";
  out += "\"ap_ip\":\"" + jsonEscape(ipToString(WiFi.softAPIP())) + "\",";
  out += "\"rssi\":" + String(WiFi.status() == WL_CONNECTED ? WiFi.RSSI() : 0) + ",";
  out += "\"joy\":{";
  out += "\"a0_raw\":" + String(gJoyRaw) + ",";
  out += "\"a0_smooth\":" + String(static_cast<uint16_t>(gJoySmooth)) + ",";
  out += "\"sw\":" + String(gJoySwPressed ? "true" : "false");
  out += "},";
  out += "\"morse\":{";
  out += "\"text\":\"" + String(kMorseText) + "\",";
  out += "\"letter\":\"" + String(gMorseLetter) + "\",";
  out += "\"on\":" + String(gMorseOn ? "true" : "false") + ",";
  out += "\"symbol\":\"" + String(morsePulseSymbol()) + "\",";
  out += "\"unit_ms\":" + String(kMorseUnitMs) + ",";
  out += "\"step\":" + String(static_cast<unsigned>(gMorseStepIndex));
  out += "},";
  out += "\"espnow\":{";
  out += "\"ready\":" + String(gEspNowReady ? "true" : "false") + ",";
  out += "\"tx_ok\":" + String(gEspNowTxOk) + ",";
  out += "\"tx_fail\":" + String(gEspNowTxFail) + ",";
  out += "\"rx_count\":" + String(gEspNowRxCount) + ",";
  out += "\"peer_count\":" + String(static_cast<unsigned>(gEspNowPeerCount)) + ",";
  out += "\"active_peers\":" + String(static_cast<unsigned>(countEspNowActivePeers(nowMs))) + ",";
  out += "\"last_peer\":\"" + String(gEspNowLastPeer) + "\",";
  out += "\"last_rx_ms\":" + String(gEspNowLastRxMs);
  out += "},";
  out += "\"oled\":{";
  out += "\"ready\":" + String(gOledReady ? "true" : "false") + ",";
  out += "\"addr\":\"0x" + String(gOledAddr, HEX) + "\",";
  out += "\"sda\":" + String(kOledSdaPin) + ",";
  out += "\"scl\":" + String(kOledSclPin);
  out += "}";
  out += "}";
  return out;
}

void handleRoot() {
  static const char kHtml[] PROGMEM = R"HTML(
<!doctype html>
<html lang="fr">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width,initial-scale=1" />
<title>OSCILLO ESP8266</title>
<style>
:root {
  --bg: #0b1418;
  --panel: #122028;
  --line: #2f5363;
  --text: #e4f3f9;
  --muted: #9bbac8;
}
* { box-sizing: border-box; }
body {
  margin: 0;
  font-family: "IBM Plex Mono", monospace;
  background: radial-gradient(circle at 20% 0%, #1e2e38, #0b1418 55%);
  color: var(--text);
}
main { max-width: 820px; margin: 0 auto; padding: 18px; }
.card {
  border: 1px solid var(--line);
  border-radius: 14px;
  background: var(--panel);
  padding: 14px;
  margin-bottom: 12px;
}
h1 { margin: 0 0 12px; font-size: 18px; letter-spacing: .08em; text-transform: uppercase; }
.row { display: flex; justify-content: space-between; border-bottom: 1px dashed #24414f; padding: 6px 0; }
.label { color: var(--muted); }
input {
  width: 100%;
  background: #0d1a21;
  color: var(--text);
  border: 1px solid #2a4959;
  border-radius: 8px;
  padding: 8px;
  margin: 6px 0;
}
button {
  width: 100%;
  border: 0;
  border-radius: 8px;
  padding: 10px;
  background: linear-gradient(120deg, #2f9eb4, #4cb4a0);
  color: #021015;
  font-weight: bold;
}
small { color: var(--muted); }
</style>
</head>
<body>
<main>
  <div class="card">
    <h1>OSCILLO ESP8266 OLED</h1>
    <div class="row"><span class="label">Mode</span><span id="mode">-</span></div>
    <div class="row"><span class="label">IP</span><span id="ip">-</span></div>
    <div class="row"><span class="label">RSSI</span><span id="rssi">-</span></div>
    <div class="row"><span class="label">A0</span><span id="a0">-</span></div>
    <div class="row"><span class="label">Switch</span><span id="sw">-</span></div>
    <div class="row"><span class="label">ESP-NOW</span><span id="espnow">-</span></div>
    <div class="row"><span class="label">OLED</span><span id="oled">-</span></div>
  </div>
  <div class="card">
    <small>Update Wi-Fi credentials (saved to EEPROM):</small>
    <input id="ssid" placeholder="SSID" />
    <input id="pass" placeholder="Password" type="password" />
    <button id="saveBtn">Save And Reconnect</button>
  </div>
</main>
<script>
async function refresh(){
  const r = await fetch('/api/status');
  const s = await r.json();
  mode.textContent = s.wifi_mode;
  ip.textContent = s.ip && s.ip !== '0.0.0.0' ? s.ip : s.ap_ip;
  rssi.textContent = s.wifi_mode === 'STA' ? s.rssi + ' dBm' : '-';
  a0.textContent = `${s.joy.a0_raw} (smooth ${s.joy.a0_smooth})`;
  sw.textContent = s.joy.sw ? 'ON' : 'OFF';
  espnow.textContent = s.espnow ? `${s.espnow.active_peers}/${s.espnow.peer_count} peers` : '-';
  oled.textContent = `${s.oled.ready ? 'OK' : 'OFF'} @ ${s.oled.addr}`;
}
saveBtn.onclick = async () => {
  const fd = new URLSearchParams();
  fd.set('ssid', ssid.value);
  fd.set('pass', pass.value);
  const r = await fetch('/api/wifi/select', {method:'POST', body: fd});
  const j = await r.json();
  alert(j.ok ? 'Saved' : ('Error: ' + (j.error || 'unknown')));
};
