electron-rare/le-mystere-professeur-zacus/hardware/firmware/hardware/esp_oscillo/src/main_esp8266_oled 3.cpp
setInterval(refresh, 1000);
refresh();
</script>
</body>
</html>
)HTML";

  gServer.send_P(200, "text/html", kHtml);
}

void handleStatus() {
  gServer.send(200, "application/json", buildStatusJson());
}

void handleWifiScan() {
  refreshWifiScanCache(true);
  String out = "{";
  out += "\"count\":" + String(gScanCount) + ",\"networks\":[";
  for (size_t i = 0; i < gScanCount; ++i) {
    if (i > 0) {
      out += ",";
    }
    char macText[18] = "-";
    formatMac(gScanEntries[i].bssid, macText, sizeof(macText));
    out += "{";
    out += "\"ssid\":\"" + jsonEscape(gScanEntries[i].ssid) + "\",";
    out += "\"rssi\":" + String(gScanEntries[i].rssi) + ",";
    out += "\"channel\":" + String(gScanEntries[i].channel) + ",";
    out += "\"bssid\":\"" + String(macText) + "\"";
    out += "}";
  }
  out += "]}";
  gServer.send(200, "application/json", out);
}

void handleWifiSelect() {
  if (!gServer.hasArg("ssid")) {
    gServer.send(400, "application/json", "{\"ok\":false,\"error\":\"missing ssid\"}");
    return;
  }

  const String ssid = gServer.arg("ssid");
  const String pass = gServer.arg("pass");
  if (ssid.isEmpty()) {
    gServer.send(400, "application/json", "{\"ok\":false,\"error\":\"empty ssid\"}");
    return;
  }

  saveWifiCredentialsToEeprom(ssid, pass);
  beginStaConnectWithBestRssi();
  gServer.send(200, "application/json", "{\"ok\":true}");
}

void handleEspNowPeers() {
  const uint32_t nowMs = millis();
  String out = "{";
  out += "\"ok\":true,";
  out += "\"count\":" + String(static_cast<unsigned>(gEspNowPeerCount)) + ",";
  out += "\"active\":" + String(static_cast<unsigned>(countEspNowActivePeers(nowMs))) + ",";
  out += "\"peers\":[";
  for (size_t i = 0; i < gEspNowPeerCount; ++i) {
    if (i > 0) {
      out += ",";
    }
    char macText[18] = "-";
    formatMac(gEspNowPeers[i].mac, macText, sizeof(macText));
    const uint32_t ageMs = nowMs - gEspNowPeers[i].lastSeenMs;
    const bool active = ageMs <= kEspNowPeerActiveMs;
    out += "{";
    out += "\"mac\":\"" + String(macText) + "\",";
    out += "\"name\":\"" + String(gEspNowPeers[i].name) + "\",";
    out += "\"type\":\"" + String(gEspNowPeers[i].lastType) + "\",";
    out += "\"rx_count\":" + String(gEspNowPeers[i].rxCount) + ",";
    out += "\"last_seen_ms\":" + String(gEspNowPeers[i].lastSeenMs) + ",";
    out += "\"age_ms\":" + String(ageMs) + ",";
    out += "\"active\":" + String(active ? "true" : "false");
    out += "}";
  }
  out += "]}";
  gServer.send(200, "application/json", out);
}

void startWebServer() {
  gServer.on("/", HTTP_GET, handleRoot);
  gServer.on("/api/status", HTTP_GET, handleStatus);
  gServer.on("/api/wifi/scan", HTTP_GET, handleWifiScan);
  gServer.on("/api/wifi/select", HTTP_POST, handleWifiSelect);
  gServer.on("/api/espnow/peers", HTTP_GET, handleEspNowPeers);
  gServer.begin();
  Serial.println("[WEB] HTTP server started on :80");
}

void printStatusSerial() {
  const uint32_t nowMs = millis();
  Serial.printf(
      "[STATUS] mode=%s ip=%s ap_ip=%s rssi=%d a0=%u sm=%u sw=%s morse=%c:%s(%c) dac=D5..D8 espnow=%s peers=%u/%u tx=%lu/%lu rx=%lu oled=%s(0x%02X)\n",
                wifiModeText().c_str(), ipToString(WiFi.localIP()).c_str(),
                ipToString(WiFi.softAPIP()).c_str(), WiFi.RSSI(), gJoyRaw,
                static_cast<uint16_t>(gJoySmooth), gJoySwPressed ? "ON" : "OFF",
                gMorseLetter, gMorseOn ? "ON" : "OFF", morsePulseSymbol(),
                gEspNowReady ? "ON" : "OFF", static_cast<unsigned>(countEspNowActivePeers(nowMs)),
                static_cast<unsigned>(gEspNowPeerCount), static_cast<unsigned long>(gEspNowTxOk),
                static_cast<unsigned long>(gEspNowTxFail), static_cast<unsigned long>(gEspNowRxCount),
                gOledReady ? "ON" : "OFF", gOledAddr);
}

void printEspNowPeersSerial() {
  const uint32_t nowMs = millis();
  Serial.printf("[ESPNOW] peers=%u active=%u last_peer=%s last_rx_ms=%lu\n",
                static_cast<unsigned>(gEspNowPeerCount),
                static_cast<unsigned>(countEspNowActivePeers(nowMs)), gEspNowLastPeer,
                static_cast<unsigned long>(gEspNowLastRxMs));
  for (size_t i = 0; i < gEspNowPeerCount; ++i) {
    char macText[18] = "-";
    formatMac(gEspNowPeers[i].mac, macText, sizeof(macText));
    const uint32_t ageMs = nowMs - gEspNowPeers[i].lastSeenMs;
    Serial.printf("  [%02u] mac=%s name=%s type=%s rx=%lu age=%lums %s\n", static_cast<unsigned>(i),
                  macText, gEspNowPeers[i].name, gEspNowPeers[i].lastType,
                  static_cast<unsigned long>(gEspNowPeers[i].rxCount),
                  static_cast<unsigned long>(ageMs), (ageMs <= kEspNowPeerActiveMs) ? "ACTIVE" : "STALE");
  }
}

void printHelp() {
  Serial.println("Commands:");
  Serial.println("  help");
  Serial.println("  status");
  Serial.println("  scan");
  Serial.println("  wifi");
  Serial.println("  espnow");
  Serial.println("  peers");
  Serial.println("  discover");
  Serial.println("  reconnect");
  Serial.println("  setwifi <ssid> <pass>");
  Serial.println("  i2c");
  Serial.println("  oled");
}

void handleSerialCommand(const String& raw) {
  String cmd = raw;
  cmd.trim();
  if (cmd.isEmpty()) {
    return;
  }

  if (cmd.equalsIgnoreCase("help")) {
    printHelp();
    return;
  }

  if (cmd.equalsIgnoreCase("status") || cmd.equalsIgnoreCase("wifi")) {
    printStatusSerial();
    return;
  }

  if (cmd.equalsIgnoreCase("espnow")) {
    printEspNowPeersSerial();
    return;
  }

  if (cmd.equalsIgnoreCase("peers")) {
    printEspNowPeersSerial();
    return;
  }

  if (cmd.equalsIgnoreCase("discover")) {
    gEspNowForceDiscovery = true;
    Serial.println("[ESPNOW] forced discovery broadcast");
    return;
  }

  if (cmd.equalsIgnoreCase("scan")) {
    refreshWifiScanCache(true);
    for (size_t i = 0; i < gScanCount; ++i) {
      char macText[18] = "-";
      formatMac(gScanEntries[i].bssid, macText, sizeof(macText));
      Serial.printf("[%02u] ssid=%s rssi=%ld ch=%u bssid=%s\n", static_cast<unsigned>(i),
                    gScanEntries[i].ssid.c_str(), static_cast<long>(gScanEntries[i].rssi),
                    gScanEntries[i].channel, macText);
    }
    if (gScanCount == 0) {
      Serial.println("[WIFI] No networks in scan cache");
    }
    return;
  }

  if (cmd.equalsIgnoreCase("reconnect")) {
    beginStaConnectWithBestRssi();
    return;
  }

  if (cmd.equalsIgnoreCase("i2c")) {
    scanI2cBusToSerial();
    return;
  }

  if (cmd.equalsIgnoreCase("oled")) {
    if (!gOledReady) {
      Serial.println("[OLED] not ready");
    } else {
      Serial.printf("[OLED] ready addr=0x%02X sda=%u scl=%u\n", gOledAddr, kOledSdaPin,
                    kOledSclPin);
    }
    return;
  }

  const String prefix = "setwifi ";
  if (cmd.startsWith(prefix)) {
    const String payload = cmd.substring(prefix.length());
    const int split = payload.indexOf(' ');
    if (split <= 0) {
      Serial.println("[WIFI] Usage: setwifi <ssid> <pass>");
      return;
    }
    const String ssid = payload.substring(0, split);
    const String pass = payload.substring(split + 1);
    saveWifiCredentialsToEeprom(ssid, pass);
    Serial.printf("[WIFI] Saved credentials for ssid='%s'\n", ssid.c_str());
    beginStaConnectWithBestRssi();
    return;
  }

  Serial.printf("[SERIAL] Unknown command: %s\n", cmd.c_str());
}

void serviceSerial() {
  while (Serial.available() > 0) {
    const char c = static_cast<char>(Serial.read());
    if (c == '\n' || c == '\r') {
      if (!gSerialLine.isEmpty()) {
        handleSerialCommand(gSerialLine);
        gSerialLine = "";
      }
    } else {
      gSerialLine += c;
      if (gSerialLine.length() > 180) {
        gSerialLine = "";
      }
    }
  }
}

void appSetup() {
  Serial.begin(115200);
  Serial.println();
  Serial.println(F("[BOOT] OSCILLO ESP8266 OLED starting"));

  if (kStatusLedPin != 0xFF) {
    pinMode(kStatusLedPin, OUTPUT);
  }
  setStatusLed(false);
  pinMode(kJoySwPin, INPUT_PULLUP);
  pinMode(kMorseOutPin, OUTPUT);
  digitalWrite(kMorseOutPin, LOW);
  for (size_t i = 0; i < 4; ++i) {
    pinMode(kPcm4BitPins[i], OUTPUT);
    digitalWrite(kPcm4BitPins[i], LOW);
  }
  randomSeed(micros() ^ static_cast<uint32_t>(analogRead(kJoyAdcPin)));

  EEPROM.begin(kEepromSize);
  loadWifiCredentialsFromEeprom();

  Serial.printf("[CFG] STA ssid='%s'\n", gStaSsid.c_str());
  Serial.printf("[CFG] OLED SDA=%u SCL=%u (%s)\n", kOledSdaPin, kOledSclPin, kOledBusLabel);
  Serial.printf("[CFG] MORSE_OUT=D4 DAC=D5,D6,D7,D8 SW=D3 A0=A0\n");

  initOled();
  scanI2cBusToSerial();
  startMorseStep(millis());
  gLastSineUs = micros();
  gLastScopeSampleMs = millis();
  gLastSineAmpUpdateMs = millis();
  gNextSineAmpDelayMs = kSineAmpMinStepMs;
  gSineGlitchAmp = static_cast<uint8_t>(
      random(static_cast<long>(kSineAmpMin), static_cast<long>(kSineAmpMax + 1U)));
  for (size_t i = 0; i < kOledWidth; ++i) {
    gMorseScope[i] = 0;
  }

  beginStaConnectWithBestRssi();
  initEspNow();
  startWebServer();
  printHelp();
}

void appLoop() {
  const uint32_t nowMs = millis();
  const uint32_t nowUs = micros();

  serviceSerial();
  gServer.handleClient();
  sampleJoystick(nowMs);
  serviceMorse(nowMs);
  serviceMorseScope(nowMs);
  serviceGlitchSineAmplitude(nowMs);
  servicePseudoSine(nowUs);
  serviceEspNow(nowMs);
  serviceWifi(nowMs);
  updateStatusLed(nowMs);
  drawOled(nowMs);

  if ((nowMs - gLastLogMs) >= kLogPeriodMs) {
    gLastLogMs = nowMs;
    printStatusSerial();
  }
}

}  // namespace

void setup() { appSetup(); }

void loop() { appLoop(); }

#endif  // ARDUINO_ARCH_ESP8266
